app/views/relationships/follower.html.erb

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 2], ["follow_id", 1], ["LIMIT", 1]]
---
      <td>フォロー数:<%= follower.followings.count %></td>
      <!-- フォロワー数:<%#= Relationship.where(user_id: user.id).count %>と一緒 -->

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 2], ["follow_id", 1], ["LIMIT", 1]]
---
		        <% if current_user.following?(follower) %>
              <%= form_for(current_user.relationships.find_by(follow_id: follower.id), html: { method: :delete }) do |f| %>