app/views/users/index.html.erb

      <td>フォロー数:<%= user.followings.count %></td>
      <!-- フォロワー数:<%#= Relationship.where(user_id: user.id).count %>と一緒 -->
---
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."user_id" = ?  [["user_id", 1]]