app/views/searches/search.html.erb

		             <%= fa_icon "fa fa-heart" %>
		             <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

		       </td>
		       <td><%= link_to "コメント数:#{book.book_comments.count}", book_path(book.id) %></td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]