app/controllers/book_comments_controller.rb

	def create
		#対象のbookの情報を取得
		@book = Book.find(params[:book_id])
		#コメントはログインしているユーザがするよ。空のモデルを作る事でコメントの情報が入るよ。
		@book_comment = current_user.book_comments.new(book_comment_params)
		#コメントは何に対してするの？　＝　本に対してだよ。
		@book_comment.book_id = @book.id
		#コメントをセーブするよ
		@book_comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "komento"], ["user_id", 1], ["book_id", 2], ["created_at", "2020-05-05 14:06:52.158624"], ["updated_at", "2020-05-05 14:06:52.158624"]]

	def destroy
		@book_comment = BookComment.find(params[:book_id])
		@book = @book_comment.book
		if @book_comment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 2]]